Catalogs/упСхемыМультимодальныхПеревозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упСхемыМультимодальныхПеревозок</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресВозврата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПолучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПолученияТарыДляВозвратнойЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВариантыВажности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОпределенияВременногоОкнаОтправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВариантыОпределенияВременныхОкон</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОпределенияВременногоОкнаПолучения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВариантыОпределенияВременныхОкон</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозкиОтбор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВПутиДоКонечнойТочки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказчикОтбор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаПолучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпределятьВременныеОкнаЗаданий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияОтбор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеНачалаМаршрута</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОкончанияМаршрута</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоглашениеОтбор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьВременныеОкнаПоГрафикамРаботыАдресов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПромежуточныеТочкиМаршрута</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОпределенияВременногоОкнаОтправления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упВариантыОпределенияВременныхОкон</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОпределенияВременногоОкнаПолучения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упВариантыОпределенияВременныхОкон</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПеревозки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упВидыПеревозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВПути</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНахожденияВТочке</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрафикРаботыАдресаОтправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Календари</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрафикРаботыАдресаПолучения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Календари</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицоОтправителя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упКонтактныеЛицаПартнеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицоПолучателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упКонтактныеЛицаПартнеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентОтправителя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентПолучателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отправитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расписание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Календари</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧасовойПояс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упЧасовыеПояса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/упВариантыОпределенияВременныхОкон.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упВариантыОпределенияВременныхОкон</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПостояннаяДоступность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолноеОграничение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТолькоНачалоОкна</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТолькоОкончаниеОкна</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упСхемыМультимодальныхПеревозок/Forms/ФормаНастроекПеревозки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.ПараметрыПеревозки);
	
	Элементы.ВариантОпределенияВременногоОкнаОтправления.Видимость 	= ОпределятьВременныеОкнаЗаданий;
	Элементы.ВариантОпределенияВременногоОкнаПолучения.Видимость 	= ОпределятьВременныеОкнаЗаданий;
	Элементы.ГруппаВремяНахожденияВТочке.Видимость 				= ОпределятьВременныеОкнаЗаданий;
	Элементы.ГрафикРаботыАдресаОтправления.Видимость				= ОпределятьВременныеОкнаЗаданий И ФормироватьВременныеОкнаПоГрафикамРаботыАдресов;
	Элементы.ГрафикРаботыАдресаПолучения.Видимость				= ОпределятьВременныеОкнаЗаданий И ФормироватьВременныеОкнаПоГрафикамРаботыАдресов;
	
	Если ОпределятьВременныеОкнаЗаданий Тогда
		Если НЕ ЗначениеЗаполнено(ВариантОпределенияВременногоОкнаПолучения) Тогда
			ВариантОпределенияВременногоОкнаПолучения 	= Перечисления.упВариантыОпределенияВременныхОкон.ПолноеОграничение;
			ВариантОпределенияВременногоОкнаОтправления 	= Перечисления.упВариантыОпределенияВременныхОкон.ПолноеОграничение;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	КонтрагентПолучателя = ПолучитьОсновногоКонтрагента(Получатель);		
КонецПроцедуры

&НаКлиенте
Процедура ОтправительПриИзменении(Элемент)
	КонтрагентОтправителя = ПолучитьОсновногоКонтрагента(Отправитель);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийКоманд

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	сткРезультат = Новый Структура;
	сткРезультат.Вставить("Отправитель");
	сткРезультат.Вставить("Получатель");
	сткРезультат.Вставить("КонтактноеЛицоОтправителя");
	сткРезультат.Вставить("КонтактноеЛицоПолучателя");
	сткРезультат.Вставить("КонтрагентОтправителя");
	сткРезультат.Вставить("КонтрагентПолучателя");
	сткРезультат.Вставить("НомерСтроки");
	сткРезультат.Вставить("ВремяВПути");
	сткРезультат.Вставить("ЧасовойПояс");
	сткРезультат.Вставить("ВремяНахожденияВТочке");
	сткРезультат.Вставить("ВариантОпределенияВременногоОкнаПолучения");
	сткРезультат.Вставить("ГрафикРаботыАдресаПолучения");
	сткРезультат.Вставить("ВариантОпределенияВременногоОкнаОтправления");
	сткРезультат.Вставить("ГрафикРаботыАдресаОтправления");
	ЗаполнитьЗначенияСвойств(сткРезультат, ЭтаФорма);
	Закрыть(сткРезультат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервереБезКонтекста
Функция ПолучитьОсновногоКонтрагента(Партнер)
	Возврат Справочники.упКонтрагенты.ПолучитьОсновногоКонтрагента(Партнер);	
КонецФункции

#КонецОбласти
